# IsLateAddinLoading Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIControlledApplication..::..IsLateAddinLoading Property
UIControlledApplication Class See Also
---
Indicates whether this add-in is loaded on the fly or not. If it is loaded when Revit is starting up, it is false, otherwise it should be true.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsLateAddinLoading { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsLateAddinLoading As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsLateAddinLoading {
	bool get ();
}
```

# See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace